app/controllers/boards_controller.rb

SELECT COUNT(*) FROM `boards`
SELECT `boards`.* FROM `boards` LIMIT 25 OFFSET 0
---
  def index
    @boards = Board.page(params[:page])

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('あたらしい掲示板', '新しい掲示板', '新しい掲示板\n新しい掲示板\n新しい掲示板', '2023-09-20 05:12:46.524269', '2023-09-20 05:12:46.524269')
---
  def create
    board = Board.new(board_params)

    if board.save

SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
UPDATE `boards` SET `boards`.`name` = 'eee2ee', `boards`.`title` = 'aaa3ee', `boards`.`body` = 'れいるずてすと投稿\r\n開業いれてみる\r\n', `boards`.`updated_at` = '2023-09-19 07:23:15.276872' WHERE `boards`.`id` = 2
---
  def update
   board = Board.find(params[:id])
    if board.update(board_params)

DELETE FROM `boards` WHERE `boards`.`id` = 9
---
  def destroy
   # @board = Board.find(params[:id])
   @board.destroy

SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 5 LIMIT 1
---
  def set_target_board
    @board = Board.find(params[:id])